package com.software.dm.swallow.stormy.scalacode

/**
  * 对象 - 对象有属性和行为。例如：一只狗的状属性有：颜色，名字，行为有：叫、跑、吃等。对象是一个类的实例。
  * 类 - 类是对象的抽象，而对象是类的具体实例。
  * 方法 - 方法描述的基本的行为，一个类可以包含多个方法。
  * 字段 - 每个对象都有它唯一的实例变量集合，即字段。对象的属性通过给字段赋值来创建。
  */
object 基础语法 {

  val a = """区分大小写 -  Scala是大小写敏感的，这意味着标识Hello 和 hello在Scala中会有不同的含义。
    |类名 - 对于所有的类名的第一个字母要大写。
    |
    |如果需要使用几个单词来构成一个类的名称，每个单词的第一个字母要大写。
    |
    |示例：class MyFirstScalaClass
    |方法名称 - 所有的方法名称的第一个字母用小写。
    |
    |如果若干单词被用于构成方法的名称，则每个单词的第一个字母应大写。
    |
    |示例：def myMethodName()
    |程序文件名 - 程序文件的名称应该与对象名称完全匹配。
    |
    |保存文件时，应该保存它使用的对象名称（记住Scala是区分大小写），并追加".scala"为文件扩展名。 （如果文件名和对象名称不匹配，程序将无法编译）。
    |
    |示例: 假设"HelloWorld"是对象的名称。那么该文件应保存为'HelloWorld.scala"
    |def main(args: Array[String]) - Scala程序从main()方法开始处理，这是每一个Scala程序的强制程序入口部分。
    |"""



}
